print('5 > 2 : ', 5 > 2)   # Порівняння чи перше число більше від другого
print('5 < 2 : ', 5 < 2)  # Порівняння чи перше число менше від другого
print('5 == 2 : ', 5 == 2)  # Порівняння чи перше число дорівнює другому
print('5 >= 2 : ', 5 >= 2)  # Порівняння чи перше число більше або рівне другому (або перше не менше другого)
print('5 <= 5 : ', 5 <= 5)  # Порівняння чи перше число менше або рівне другому (або перше не більше другого)

# Логічне "і" - and: результат "істина" тоді і тільки тоді коли обидві частини "істина"
print('True and True : ', True and True)  # Результат True, бо обидва операнди True
print('True and False : ', True and False)  # Результат False бо хоча б один операнд False
print('False and False : ', False and False)  # Результат False бо обидва операнди False

# Логічне "або" - or: результат "хиба" тоді і тільки тоді коли обидві частини "хиба"
print('True or True : ', True or True)  # Результат True, бо обидва операнди True
print('True or False : ', True or False)  # Результат True бо хоча б один операнд True
print('False or False : ', False or False)  # Результат False бо обидва операнди False

# Логічне "не" - not : перетворює "істину" на "хибу" і навпаки - "хибу" на "істину"
print('not True : ', not True)  # Результат False , бо операнд True
print('not False : ', not False)  # Результат True , бо операнд False

# операнд - це те з чим працює оператор, тобто у виразі a + b a та b операнди, а + це  оператор
