for count in range(1, 100+1):  # Ініціюємо перебір чисел від 1 до 100 за допомогою циклу for
    if count % 3 == 0 and count % 5 == 0:  # Перевіряємо чи остача від ділення числа на 3 та на 5 одночасно рівна 0
        print('Fizz-Buzz')  # Якщо умова виконалась, то виводимо на екран 'Fizz-Buzz'
    elif count % 3 == 0:  # якщо попередня умова не виконалась, перевіряємо чи остача від ділення числа на 3 рівна 0
        print('Fizz')  # Якщо умова виконалась, то виводимо на екран 'Fizz'
    elif count % 5 == 0:  # якщо попередні умови не виконались, перевіряємо чи остача від ділення числа на 5 рівна 0
        print('Buzz')   # Якщо умова виконалась, то виводимо на екран 'Buzz'
    else:
        print(count)  # Якщо жодна з попередніх умов не виконалась, то виводимо на екран число
