# Приклад перевірки число більше, рівне чи менше нуля за допомогою розгалудження.
number = float(input("Введіть число= "))  # Запитуємо в користувача число і перетворюємо результат в воду в число

if number > 0:   # Перевіряємо умову чи число більше 0
    print("число більше 0")   # Якщо умова виконалась, то виводимо повідомлення на екран "число більше 0"
elif number == 0:   # Якщо попередня умова не виконалась, то перевіямо чи число рівне 0
    print("число дорівнює 0")   # Якщо умова виконалась, то виводимо повідомлення на екран "число дорівнює 0"
else:
    print("чило менше 0")    # Якщо попередні умови не виконались, то виводимо повідомлення на екран "число більше 0"

print('Дякую')  # Повідомлення яке виведеться в будь якому випадку незалежно від виконання умов
