while True:  # Ініціюємо "вічний цикл" (умова циклу постійно True)
    password = input('Ведіть пароль: ')  # Просимо користувача ввести пароль
    if password == '123':   # Перевіряємо чи пароль не співпав з тим, який ми задали
        break    # Якщо умова виконалась і пароль співпав, то перериваємо цикл і виходимо з нього
    print('Пароль не правильний!!!')    # Якщо умова не виконалась то пишемо "пароль не правильний" і знову повтор циклу

print('Вітаю, вам відкрито доступ')  # Те, що виконається після того, як цикл завершиться
