# Програма виводить числа від 0 до 100 (не включно) крім чисел які діляться на 5
for count in range(100):  # Ініціюємо цикл по змінній count для чисел від 0 до 99 (100 не включається)
    if count % 5 == 0:  # В тілі циклу перевіряємо чи поточне значення count ділиться на 5 (остача від ділення 0)
        continue  # Якщо умова виконалась, то подальша частина циклу пропускається і ми повертаємось на його початок
    print(count)  # Вивід числа яке міститься в count (якщо не спрацювала інструкція continue)
